In [1]:
import pandas as pd
import numpy  as np

In [2]:
raw_data = {'regiment': ['Nighthawks', 'Nighthawks', 'Nighthawks', 'Nighthawks', 'Dragoons', 'Dragoons', 'Dragoons', 'Dragoons', 'Scouts', 'Scouts', 'Scouts', 'Scouts'], 
        'company': ['1st', '1st', '2nd', '2nd', '1st', '1st', '2nd', '2nd','1st', '1st', '2nd', '2nd'], 
        'name': ['Miller', 'Jacobson', 'Ali', 'Milner', 'Cooze', 'Jacon', 'Ryaner', 'Sone', 'Sloan', 'Piger', 'Riani', 'Ali'], 
        'preTestScore': [4, 24, 31, 2, 3, 4, 24, 31, 2, 3, 2, 3],
        'postTestScore': [25, 94, 57, 62, 70, 25, 94, 57, 62, 70, 62, 70]}

In [3]:
df = pd.DataFrame(raw_data)

In [4]:
df.head()

     regiment company      name  preTestScore  postTestScore
0  Nighthawks     1st    Miller             4             25
1  Nighthawks     1st  Jacobson            24             94
2  Nighthawks     2nd       Ali            31             57
3  Nighthawks     2nd    Milner             2             62
4    Dragoons     1st     Cooze             3             70

In [5]:
df[df['regiment'] == 'Nighthawks'].preTestScore.mean()

15.25

In [7]:
df[df['regiment'] == 'Nighthawks']['preTestScore'].mean()

15.25

In [9]:
df['company'].describe()

count      12
unique      2
top       1st
freq        6
Name: company, dtype: object

In [13]:
df.groupby('company').agg({'postTestScore' : 'mean'})

         postTestScore
company
1st          57.666667
2nd          67.000000

In [12]:
df.groupby('company')['postTestScore'].mean()

company
1st    57.666667
2nd    67.000000
Name: postTestScore, dtype: float64

In [14]:
df.groupby(['company' , 'regiment'])['postTestScore'].mean()

company  regiment
1st      Dragoons      47.5
         Nighthawks    59.5
         Scouts        66.0
2nd      Dragoons      75.5
         Nighthawks    59.5
         Scouts        66.0
Name: postTestScore, dtype: float64

In [15]:
df.groupby(['company' , 'regiment']).agg({'postTestScore' : 'mean'})

                    postTestScore
company regiment
1st     Dragoons             47.5
        Nighthawks           59.5
        Scouts               66.0
2nd     Dragoons             75.5
        Nighthawks           59.5
        Scouts               66.0